---
kind: method
id: M:Autodesk.Revit.DB.SlabShapeCreaseArray.Clear
source: html/5bd545da-3d76-7293-6a31-ada090d08b1e.htm
---
# Autodesk.Revit.DB.SlabShapeCreaseArray.Clear Method

Removes every item from the array, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```